lesson-2.org
#+title:    Python Logic and Files
#+author:   Alberto Valdez
#+email:    avq5ac1@gmail.com
#+SETUPFILE: https://albertov5.github.io/org-html-themes/org/theme-readtheorg.setup
#+PROPERTY: header-args :mkdirp yes :dir . :exports both
#+PROPERTY: header-args:shell :results value org :results silent
#+PROPERTY: header-args:python :exports both :results value org output replace

| [[./readme.org][<<Back]] |

Notes taken during class.

* Conditional Statements

Python requires indentation after the =:= operator, which means "this is a block of code". So we can nest blocks with indentation.
#+begin_src python
x = 1
if x == 1:
    print("x is equal to 1")
else:
    print("x is greater than 1")
#+end_src

#+RESULTS:
: x is equal to 1

Most editors will render tabs as 4 spaces, most allow you to edit that setting.

** Logical Operators
#+begin_src python
x = 1
y = 10
if x == 1 and y == 10:
    print("Both values are true.")
if x < 45 or y < 45:
    print("One or more statements are true.")
#+end_src

#+RESULTS:
: Both values are true.
: One or more statements are true.

** Nested and Elif
These are the possible ways to evaluate logic in Python:

| If | Elif | Else |

You can have as many =Elif= instances as you want. You can check out the comparison operators in the python documentation. [fn:1]

#+begin_src python
height = 66
age = 16
adult_permission = True
if (height > 70) and (age >= 18):
    print("Can ride all the roller coasters")
elif (height > 65) and (age >= 18):
    print("Can ride moderate roller coasters")
elif (height > 60) and (age >= 18):
    print("Can ride light roller coasters")
elif ((height > 50) and (age >= 18)) or ((adult_permission) and (height > 50)):
    print("Can ride bumper cars")
else:
    print("Stick to lazy river")
#+end_src

#+RESULTS:
: Can ride bumper cars

** Logical Matrices

| AND | T | F |
| T   | T | F |
| F   | F | F |

| OR | T | F |
| T  | T | T |
| F  | T | F |

=False= AND =anything= will always be =False=.

=True= AND =anything= will always be =True=.

