lesson-2.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-07-18 Mon 19:24 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Python Logic and Files</title>
<meta name="author" content="Alberto Valdez" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://albertov5.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://albertov5.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Python Logic and Files</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org3667f79">1. Conditional Statements</a>
<ul>
<li><a href="#org46aa7aa">1.1. Logical Operators</a></li>
<li><a href="#org962b0aa">1.2. Nested and Elif</a></li>
<li><a href="#org019e456">1.3. Logical Matrices</a></li>
</ul>
</li>
<li><a href="#org29c7d90">2. Activity Rock, Paper Scissors.</a></li>
<li><a href="#org9a13ee4">3. Loops</a></li>
<li><a href="#org37cac08">4. Activity Number Chain</a></li>
<li><a href="#orgc13f304">5. Reading and Writing Files</a></li>
<li><a href="#org5db9ce0">6. Office hours.</a></li>
</ul>
</div>
</div>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><a href="./readme.html">&lt;&lt;Back</a></td>
</tr>
</tbody>
</table>

<p>
Notes taken during class.
</p>

<div id="outline-container-org3667f79" class="outline-2">
<h2 id="org3667f79"><span class="section-number-2">1.</span> Conditional Statements</h2>
<div class="outline-text-2" id="text-1">
<p>
Python requires indentation after the <code>:</code> operator, which means &ldquo;this is a block of code&rdquo;. So we can nest blocks with indentation.
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #a9dbfa;">x</span> = <span style="color: #BBCCAA; font-weight: bold;">1</span>
<span style="color: #3399DD;">if</span> x == <span style="color: #BBCCAA; font-weight: bold;">1</span>:
    <span style="color: #CC88CC;">print</span>(<span style="color: #c5937c;">"x is equal to 1"</span>)
<span style="color: #3399DD;">else</span>:
    <span style="color: #CC88CC;">print</span>(<span style="color: #c5937c;">"x is greater than 1"</span>)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-org">x is equal to 1
</pre>
</div>

<p>
Most editors will render tabs as 4 spaces, most allow you to edit that setting.
</p>
</div>

<div id="outline-container-org46aa7aa" class="outline-3">
<h3 id="org46aa7aa"><span class="section-number-3">1.1.</span> Logical Operators</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #a9dbfa;">x</span> = <span style="color: #BBCCAA; font-weight: bold;">1</span>
<span style="color: #a9dbfa;">y</span> = <span style="color: #BBCCAA; font-weight: bold;">10</span>
<span style="color: #3399DD;">if</span> x == <span style="color: #BBCCAA; font-weight: bold;">1</span> <span style="color: #3399DD;">and</span> y == <span style="color: #BBCCAA; font-weight: bold;">10</span>:
    <span style="color: #CC88CC;">print</span>(<span style="color: #c5937c;">"Both values are true."</span>)
<span style="color: #3399DD;">if</span> x &lt; <span style="color: #BBCCAA; font-weight: bold;">45</span> <span style="color: #3399DD;">or</span> y &lt; <span style="color: #BBCCAA; font-weight: bold;">45</span>:
    <span style="color: #CC88CC;">print</span>(<span style="color: #c5937c;">"One or more statements are true."</span>)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-org">Both values are true.
One or more statements are true.
</pre>
</div>
</div>
</div>

<div id="outline-container-org962b0aa" class="outline-3">
<h3 id="org962b0aa"><span class="section-number-3">1.2.</span> Nested and Elif</h3>
<div class="outline-text-3" id="text-1-2">
<p>
These are the possible ways to evaluate logic in Python:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">If</td>
<td class="org-left">Elif</td>
<td class="org-left">Else</td>
</tr>
</tbody>
</table>

<p>
You can have as many <code>Elif</code> instances as you want. You can check out the comparison operators in the python documentation. <sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup>
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a9dbfa;">height</span> = <span style="color: #BBCCAA; font-weight: bold;">66</span>
<span style="color: #a9dbfa;">age</span> = <span style="color: #BBCCAA; font-weight: bold;">16</span>
<span style="color: #a9dbfa;">adult_permission</span> = <span style="color: #3399DD;">True</span>
<span style="color: #3399DD;">if</span> (height &gt; <span style="color: #BBCCAA; font-weight: bold;">70</span>) <span style="color: #3399DD;">and</span> (age &gt;= <span style="color: #BBCCAA; font-weight: bold;">18</span>):
    <span style="color: #CC88CC;">print</span>(<span style="color: #c5937c;">"Can ride all the roller coasters"</span>)
<span style="color: #3399DD;">elif</span> (height &gt; <span style="color: #BBCCAA; font-weight: bold;">65</span>) <span style="color: #3399DD;">and</span> (age &gt;= <span style="color: #BBCCAA; font-weight: bold;">18</span>):
    <span style="color: #CC88CC;">print</span>(<span style="color: #c5937c;">"Can ride moderate roller coasters"</span>)
<span style="color: #3399DD;">elif</span> (height &gt; <span style="color: #BBCCAA; font-weight: bold;">60</span>) <span style="color: #3399DD;">and</span> (age &gt;= <span style="color: #BBCCAA; font-weight: bold;">18</span>):
    <span style="color: #CC88CC;">print</span>(<span style="color: #c5937c;">"Can ride light roller coasters"</span>)
<span style="color: #3399DD;">elif</span> ((height &gt; <span style="color: #BBCCAA; font-weight: bold;">50</span>) <span style="color: #3399DD;">and</span> (age &gt;= <span style="color: #BBCCAA; font-weight: bold;">18</span>)) <span style="color: #3399DD;">or</span> ((adult_permission) <span style="color: #3399DD;">and</span> (height &gt; <span style="color: #BBCCAA; font-weight: bold;">50</span>)):
    <span style="color: #CC88CC;">print</span>(<span style="color: #c5937c;">"Can ride bumper cars"</span>)
<span style="color: #3399DD;">else</span>:
    <span style="color: #CC88CC;">print</span>(<span style="color: #c5937c;">"Stick to lazy river"</span>)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-org">Can ride bumper cars
</pre>
</div>
</div>
</div>

<div id="outline-container-org019e456" class="outline-3">
<h3 id="org019e456"><span class="section-number-3">1.3.</span> Logical Matrices</h3>
<div class="outline-text-3" id="text-1-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">AND</td>
<td class="org-left">T</td>
<td class="org-left">F</td>
</tr>

<tr>
<td class="org-left">T</td>
<td class="org-left">T</td>
<td class="org-left">F</td>
</tr>

<tr>
<td class="org-left">F</td>
<td class="org-left">F</td>
<td class="org-left">F</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">OR</td>
<td class="org-left">T</td>
<td class="org-left">F</td>
</tr>

<tr>
<td class="org-left">T</td>
<td class="org-left">T</td>
<td class="org-left">T</td>
</tr>

<tr>
<td class="org-left">F</td>
<td class="org-left">T</td>
<td class="org-left">F</td>
</tr>
</tbody>
</table>

<p>
<code>False</code> AND <code>anything</code> will always be <code>False</code>.
</p>

<p>
<code>True</code> AND <code>anything</code> will always be <code>True</code>.
</p>
</div>
</div>
</div>
