lesson-2.org
* Activity Rock, Paper Scissors.

Let's play rock, paper scissors!

Assumming that.
#+begin_src python :results silent
computer_choice = "r"
user_choice = "r"
#+end_src

Then we can use this nested conditional.
#+NAME: play_rps
#+begin_src python :var user_choice = "r" computer_choice = "r"
print("Let's Play Rock Paper Scissors!")
options = ["r", "p", "s"]

if user_choice == "r":
    if computer_choice == "r":
        print("We Tie.")
    elif computer_choice == "p":
        print("You loose!")
    elif computer_choice == "s":
        print("You win!")
elif user_choice == "p":
    if computer_choice == "r":
        print("You win!")
    elif computer_choice == "p":
        print("We Tie.")
    elif computer_choice == "s":
        print("You loose!")
elif user_choice == "s":
    if computer_choice == "r":
        print("You loose!")
    elif computer_choice == "p":
        print("You win!")
    elif computer_choice == "s":
        print("We tie!")
else:
    print("Pick a valid choice!")

print(f"You chose {user_choice}. I chose {computer_choice}.")
#+end_src

#+RESULTS: play_rps
: Let's Play Rock Paper Scissors!
: We Tie.
: You chose r. I chose r.

If we pick ="p"= and computer picks ="s"=.
#+CALL: play_rps(user_choice = "p", computer_choice = "s")

#+RESULTS:
: Let's Play Rock Paper Scissors!
: You loose!
: You chose p. I chose s.

If we pick ="s"= and computer picks ="p"=.
#+CALL: play_rps(user_choice = "s", computer_choice = "p")

#+RESULTS:
: Let's Play Rock Paper Scissors!
: You win!
: You chose s. I chose p.


* Loops

Python will only iterate over a list, so we can generate one list on the fly. Using the =range= keyword.
#+begin_src python
for i in range(4):
    print(i)
#+end_src

#+RESULTS:
: 0
: 1
: 2
: 3

Or we can use our own list.
#+begin_src python
person_list = ["Alex", "Bob", "Alice"]
for person in person_list:
    print(person)
#+end_src

#+RESULTS:
: Alex
: Bob
: Alice

Python also supports While loops, which will keep running forever unless we stop it with one condition.
#+begin_src python
run = 0
while run < 3:
    print(f"run! {run}")
    run = run + 1
#+end_src

#+RESULTS:
: run! 0
: run! 1
: run! 2

* Activity Number Chain

Let's assume we can start with these values.
#+begin_src python :results silent
user_play = "y"
saved_number = 0
user_number = 3
#+end_src

Then we can run the code.
#+NAME: number_chain
#+begin_src python :var user_play = "y" user_number = 3  saved_number = 0
while user_play == "y":
    for i in range(1, user_number + 1):
        print(f"{i + saved_number}")
    saved_number = saved_number + user_number
    user_play = "n"
#+end_src

#+RESULTS: number_chain
: 1
: 2
: 3

Let's then assume we give it an input of =6=.
#+CALL: number_chain(user_play = "y", user_number = 6, saved_number = 3)

#+RESULTS:
: 4
: 5
: 6
: 7
: 8
: 9

We were able to continue the sequence because we stored the last number in the =saved_number= variable. We can do it one last time for the value of =5=.

#+CALL: number_chain(user_play = "y", user_number = 5, saved_number = 9)

#+RESULTS:
: 10
: 11
: 12
: 13
: 14

