lesson-2.html

<div id="outline-container-org29c7d90" class="outline-2">
<h2 id="org29c7d90"><span class="section-number-2">2.</span> Activity Rock, Paper Scissors.</h2>
<div class="outline-text-2" id="text-2">
<p>
Let&rsquo;s play rock, paper scissors!
</p>

<p>
Assumming that.
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #a9dbfa;">computer_choice</span> = <span style="color: #c5937c;">"r"</span>
<span style="color: #a9dbfa;">user_choice</span> = <span style="color: #c5937c;">"r"</span>
</pre>
</div>

<p>
Then we can use this nested conditional.
</p>
<div class="org-src-container">
<pre class="src src-python" id="org5ddee41"><span style="color: #CC88CC;">print</span>(<span style="color: #c5937c;">"Let's Play Rock Paper Scissors!"</span>)
<span style="color: #a9dbfa;">options</span> = [<span style="color: #c5937c;">"r"</span>, <span style="color: #c5937c;">"p"</span>, <span style="color: #c5937c;">"s"</span>]

<span style="color: #3399DD;">if</span> user_choice == <span style="color: #c5937c;">"r"</span>:
    <span style="color: #3399DD;">if</span> computer_choice == <span style="color: #c5937c;">"r"</span>:
        <span style="color: #CC88CC;">print</span>(<span style="color: #c5937c;">"We Tie."</span>)
    <span style="color: #3399DD;">elif</span> computer_choice == <span style="color: #c5937c;">"p"</span>:
        <span style="color: #CC88CC;">print</span>(<span style="color: #c5937c;">"You loose!"</span>)
    <span style="color: #3399DD;">elif</span> computer_choice == <span style="color: #c5937c;">"s"</span>:
        <span style="color: #CC88CC;">print</span>(<span style="color: #c5937c;">"You win!"</span>)
<span style="color: #3399DD;">elif</span> user_choice == <span style="color: #c5937c;">"p"</span>:
    <span style="color: #3399DD;">if</span> computer_choice == <span style="color: #c5937c;">"r"</span>:
        <span style="color: #CC88CC;">print</span>(<span style="color: #c5937c;">"You win!"</span>)
    <span style="color: #3399DD;">elif</span> computer_choice == <span style="color: #c5937c;">"p"</span>:
        <span style="color: #CC88CC;">print</span>(<span style="color: #c5937c;">"We Tie."</span>)
    <span style="color: #3399DD;">elif</span> computer_choice == <span style="color: #c5937c;">"s"</span>:
        <span style="color: #CC88CC;">print</span>(<span style="color: #c5937c;">"You loose!"</span>)
<span style="color: #3399DD;">elif</span> user_choice == <span style="color: #c5937c;">"s"</span>:
    <span style="color: #3399DD;">if</span> computer_choice == <span style="color: #c5937c;">"r"</span>:
        <span style="color: #CC88CC;">print</span>(<span style="color: #c5937c;">"You loose!"</span>)
    <span style="color: #3399DD;">elif</span> computer_choice == <span style="color: #c5937c;">"p"</span>:
        <span style="color: #CC88CC;">print</span>(<span style="color: #c5937c;">"You win!"</span>)
    <span style="color: #3399DD;">elif</span> computer_choice == <span style="color: #c5937c;">"s"</span>:
        <span style="color: #CC88CC;">print</span>(<span style="color: #c5937c;">"We tie!"</span>)
<span style="color: #3399DD;">else</span>:
    <span style="color: #CC88CC;">print</span>(<span style="color: #c5937c;">"Pick a valid choice!"</span>)

<span style="color: #CC88CC;">print</span>(f<span style="color: #c5937c;">"You chose </span>{user_choice}<span style="color: #c5937c;">. I chose </span>{computer_choice}<span style="color: #c5937c;">."</span>)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-org">Let's Play Rock Paper Scissors!
We Tie.
You chose r. I chose r.
</pre>
</div>

<p>
If we pick <code>"p"</code> and computer picks <code>"s"</code>.
</p>
<div class="org-src-container">
<pre class="src src-org">Let's Play Rock Paper Scissors!
You loose!
You chose p. I chose s.
</pre>
</div>

<p>
If we pick <code>"s"</code> and computer picks <code>"p"</code>.
</p>
<div class="org-src-container">
<pre class="src src-org">Let's Play Rock Paper Scissors!
You win!
You chose s. I chose p.
</pre>
</div>
</div>
</div>


<div id="outline-container-org9a13ee4" class="outline-2">
<h2 id="org9a13ee4"><span class="section-number-2">3.</span> Loops</h2>
<div class="outline-text-2" id="text-3">
<p>
Python will only iterate over a list, so we can generate one list on the fly. Using the <code>range</code> keyword.
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #3399DD;">for</span> i <span style="color: #3399DD;">in</span> <span style="color: #CC88CC;">range</span>(<span style="color: #BBCCAA; font-weight: bold;">4</span>):
    <span style="color: #CC88CC;">print</span>(i)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-org">0
1
2
3
</pre>
</div>

<p>
Or we can use our own list.
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #a9dbfa;">person_list</span> = [<span style="color: #c5937c;">"Alex"</span>, <span style="color: #c5937c;">"Bob"</span>, <span style="color: #c5937c;">"Alice"</span>]
<span style="color: #3399DD;">for</span> person <span style="color: #3399DD;">in</span> person_list:
    <span style="color: #CC88CC;">print</span>(person)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-org">Alex
Bob
Alice
</pre>
</div>

<p>
Python also supports While loops, which will keep running forever unless we stop it with one condition.
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #a9dbfa;">run</span> = <span style="color: #BBCCAA; font-weight: bold;">0</span>
<span style="color: #3399DD;">while</span> run &lt; <span style="color: #BBCCAA; font-weight: bold;">3</span>:
    <span style="color: #CC88CC;">print</span>(f<span style="color: #c5937c;">"run! </span>{run}<span style="color: #c5937c;">"</span>)
    <span style="color: #a9dbfa;">run</span> = run + <span style="color: #BBCCAA; font-weight: bold;">1</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-org">run! 0
run! 1
run! 2
</pre>
</div>
</div>
</div>

<div id="outline-container-org37cac08" class="outline-2">
<h2 id="org37cac08"><span class="section-number-2">4.</span> Activity Number Chain</h2>
<div class="outline-text-2" id="text-4">
<p>
Let&rsquo;s assume we can start with these values.
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #a9dbfa;">user_play</span> = <span style="color: #c5937c;">"y"</span>
<span style="color: #a9dbfa;">saved_number</span> = <span style="color: #BBCCAA; font-weight: bold;">0</span>
<span style="color: #a9dbfa;">user_number</span> = <span style="color: #BBCCAA; font-weight: bold;">3</span>
</pre>
</div>

<p>
Then we can run the code.
</p>
<div class="org-src-container">
<pre class="src src-python" id="org861562d"><span style="color: #3399DD;">while</span> user_play == <span style="color: #c5937c;">"y"</span>:
    <span style="color: #3399DD;">for</span> i <span style="color: #3399DD;">in</span> <span style="color: #CC88CC;">range</span>(<span style="color: #BBCCAA; font-weight: bold;">1</span>, user_number + <span style="color: #BBCCAA; font-weight: bold;">1</span>):
        <span style="color: #CC88CC;">print</span>(f<span style="color: #c5937c;">"</span>{i + saved_number}<span style="color: #c5937c;">"</span>)
    saved_number = saved_number + user_number
    user_play = <span style="color: #c5937c;">"n"</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-org">1
2
3
</pre>
</div>

<p>
Let&rsquo;s then assume we give it an input of <code>6</code>.
</p>
<div class="org-src-container">
<pre class="src src-org">4
5
6
7
8
9
</pre>
</div>

<p>
We were able to continue the sequence because we stored the last number in the <code>saved_number</code> variable. We can do it one last time for the value of <code>5</code>.
</p>

<div class="org-src-container">
<pre class="src src-org">10
11
12
13
14
</pre>
</div>
</div>
</div>
