lesson-2.org
* Reading and Writing Files

Let's move to the working directory.
#+begin_src shell :results output replace
cd ./resources/3-2-Student-Resources/09-Evr_WritingNetflixData
echo "---this is the path---"
pwd
echo "---these are the files in the path---"
ls
#+end_src

#+RESULTS:
#+begin_example
---this is the path---
/Users/albertovaldez/tec-data/tec-data-03-python/resources/3-2-Student-Resources/09-Evr_WritingNetflixData
---these are the files in the path---
README.md
Resources
Unsolved
output
solved_write_netflix.py
#+end_example

Let's assume we are looking for this video.
#+begin_src python :results silent
video = "Breaking Bad"
#+end_src

We need to iterate over the rows of the file, the structure is something like:

=csvreader[rows[columns]]=

So we need a for loop and then use =[0]= to index the first column, which will be the "title", as our file looks like:

| title        | rating | ratinglevel            | etc... |
|--------------+--------+------------------------+--------|
| White Chicks | PG-13  | "crude and humour"     | etc... |
| Breaking Bad | TV-MA  | "For mature audiences" | etc... |
| etc...       | etc... | etc...                 | etc... |

Let's use the =os= and =csv= modules in order to both read and write the files.
#+NAME: search_video
#+begin_src python :var video = "Breaking Bad" :dir ./resources/3-2-Student-Resources/09-Evr_WritingNetflixData
import os
import csv

csvpath = os.path.join("resources", "netflix_ratings.csv")
outputpath = os.path.join("output", "video_result.txt")
found = False

with open(csvpath, newline="") as csvfile:
    csvreader = csv.reader(csvfile, delimiter=",")
    for row in csvreader:
        if row[0] == video:
            found = True
            with open(outputpath, "a") as textfile:
                # title, rating, ratinglevel
                contents = f"Title: {row[0]}, Rating Level: {row[1]} ({row[2]})\n"
                textfile.write(contents)
                print(contents)
            break
    if found is False:
        print("Sorry about this, we don't seem to have what you are looking for!")
#+end_src

#+RESULTS: search_video
: Title: Breaking Bad, Rating Level: TV-MA (For mature audiences.  May not be suitable for children 17 and under.)

Then our output file will look like this:

#+begin_src shell :results output replace :dir ./resources/3-2-Student-Resources/09-Evr_WritingNetflixData
cat output/video_result.txt
#+end_src

#+RESULTS:
#+begin_example
Title: Breaking Bad, Rating Level: TV-MA (For mature audiences.  May not be suitable for children 17 and under.)
#+end_example

Now let's try to find it using =video = Scream=.
#+CALL: search_video(video = "Scream") :dir ./resources/3-2-Student-Resources/09-Evr_WritingNetflixData

#+RESULTS:
: Title: Scream, Rating Level: TV-14 (Parents strongly cautioned. May be unsuitable for children ages 14 and under.)

Let's take a look at the file again.
#+begin_src shell :results output replace :dir ./resources/3-2-Student-Resources/09-Evr_WritingNetflixData
cat output/video_result.txt
#+end_src

#+RESULTS:
#+begin_example
Title: Scream, Rating Level: TV-14 (Parents strongly cautioned. May be unsuitable for children ages 14 and under.)
#+end_example

Extra tip: We can empty the .txt file with this command.
#+begin_src shell :dir ./resources/3-2-Student-Resources/09-Evr_WritingNetflixData
> output/video_result.txt
#+end_src

* Office hours.

Make sure you are in the right directory!

* Footnotes

[fn:1]https://docs.python.org/3/reference/expressions.html#comparisons
