lesson-2.html

<div id="outline-container-orgc13f304" class="outline-2">
<h2 id="orgc13f304"><span class="section-number-2">5.</span> Reading and Writing Files</h2>
<div class="outline-text-2" id="text-5">
<p>
Let&rsquo;s move to the working directory.
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #33CCAA;">cd</span> ./resources/3-2-Student-Resources/09-Evr_WritingNetflixData
<span style="color: #33CCAA;">echo</span> <span style="color: #c5937c;">"---this is the path---"</span>
<span style="color: #33CCAA;">pwd</span>
<span style="color: #33CCAA;">echo</span> <span style="color: #c5937c;">"---these are the files in the path---"</span>
<span style="color: #33CCAA;">ls</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-org">---this is the path---
/Users/albertovaldez/tec-data/03-python/resources/3-2-Student-Resources/09-Evr_WritingNetflixData
---these are the files in the path---
README.md
Resources
Unsolved
output
solved_write_netflix.py
</pre>
</div>

<p>
Let&rsquo;s assume we are looking for this video.
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #a9dbfa;">video</span> = <span style="color: #c5937c;">"Breaking Bad"</span>
</pre>
</div>

<p>
We need to iterate over the rows of the file, the structure is something like:
</p>

<p>
<code>csvreader[rows[columns]]</code>
</p>

<p>
So we need a for loop and then use <code>[0]</code> to index the first column, which will be the &ldquo;title&rdquo;, as our file looks like:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">title</th>
<th scope="col" class="org-left">rating</th>
<th scope="col" class="org-left">ratinglevel</th>
<th scope="col" class="org-left">etc&#x2026;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">White Chicks</td>
<td class="org-left">PG-13</td>
<td class="org-left">&ldquo;crude and humour&rdquo;</td>
<td class="org-left">etc&#x2026;</td>
</tr>

<tr>
<td class="org-left">Breaking Bad</td>
<td class="org-left">TV-MA</td>
<td class="org-left">&ldquo;For mature audiences&rdquo;</td>
<td class="org-left">etc&#x2026;</td>
</tr>

<tr>
<td class="org-left">etc&#x2026;</td>
<td class="org-left">etc&#x2026;</td>
<td class="org-left">etc&#x2026;</td>
<td class="org-left">etc&#x2026;</td>
</tr>
</tbody>
</table>

<p>
Let&rsquo;s use the <code>os</code> and <code>csv</code> modules in order to both read and write the files.
</p>
<div class="org-src-container">
<pre class="src src-python" id="orgc25f95b"><span style="color: #3399DD;">import</span> os
<span style="color: #3399DD;">import</span> csv

<span style="color: #a9dbfa;">csvpath</span> = os.path.join(<span style="color: #c5937c;">"resources"</span>, <span style="color: #c5937c;">"netflix_ratings.csv"</span>)
<span style="color: #a9dbfa;">outputpath</span> = os.path.join(<span style="color: #c5937c;">"output"</span>, <span style="color: #c5937c;">"video_result.txt"</span>)
<span style="color: #a9dbfa;">found</span> = <span style="color: #3399DD;">False</span>

<span style="color: #3399DD;">with</span> <span style="color: #CC88CC;">open</span>(csvpath, newline=<span style="color: #c5937c;">""</span>) <span style="color: #3399DD;">as</span> csvfile:
    csvreader = csv.reader(csvfile, delimiter=<span style="color: #c5937c;">","</span>)
    <span style="color: #3399DD;">for</span> row <span style="color: #3399DD;">in</span> csvreader:
        <span style="color: #3399DD;">if</span> row[<span style="color: #BBCCAA; font-weight: bold;">0</span>] == video:
            found = <span style="color: #3399DD;">True</span>
            <span style="color: #3399DD;">with</span> <span style="color: #CC88CC;">open</span>(outputpath, <span style="color: #c5937c;">"a"</span>) <span style="color: #3399DD;">as</span> textfile:
                <span style="color: #559944;"># </span><span style="color: #559944;">title, rating, ratinglevel</span>
                contents = f<span style="color: #c5937c;">"Title: </span>{row[0]}<span style="color: #c5937c;">, Rating Level: </span>{row[1]}<span style="color: #c5937c;"> (</span>{row[2]}<span style="color: #c5937c;">)\n"</span>
                textfile.write(contents)
                <span style="color: #CC88CC;">print</span>(contents)
            <span style="color: #3399DD;">break</span>
    <span style="color: #3399DD;">if</span> found <span style="color: #3399DD;">is</span> <span style="color: #3399DD;">False</span>:
        <span style="color: #CC88CC;">print</span>(<span style="color: #c5937c;">"Sorry about this, we don't seem to have what you are looking for!"</span>)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-org">Title: Breaking Bad, Rating Level: TV-MA (For mature audiences.  May not be suitable for children 17 and under.)

</pre>
</div>

<p>
Then our output file will look like this:
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: #33CCAA;">cat</span> output/video_result.txt
</pre>
</div>

<div class="org-src-container">
<pre class="src src-org">echo $?Title: Breaking Bad, Rating Level: TV-MA (For mature audiences.  May not be suitable for children 17 and under.)
</pre>
</div>

<p>
Now let&rsquo;s try to find it using <code>video = Scream</code>.
</p>
<div class="org-src-container">
<pre class="src src-org">Title: Scream, Rating Level: TV-14 (Parents strongly cautioned. May be unsuitable for children ages 14 and under.)

</pre>
</div>

<p>
Let&rsquo;s take a look at the file again.
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #33CCAA;">cat</span> output/video_result.txt
</pre>
</div>

<div class="org-src-container">
<pre class="src src-org">echo $?Title: Breaking Bad, Rating Level: TV-MA (For mature audiences.  May not be suitable for children 17 and under.)
Title: Scream, Rating Level: TV-14 (Parents strongly cautioned. May be unsuitable for children ages 14 and under.)
</pre>
</div>

<p>
Extra tip: We can empty the .txt file with this command.
</p>
<div class="org-src-container">
<pre class="src src-shell">&gt; output/video_result.txt
</pre>
</div>
</div>
</div>

<div id="outline-container-org5db9ce0" class="outline-2">
<h2 id="org5db9ce0"><span class="section-number-2">6.</span> Office hours.</h2>
<div class="outline-text-2" id="text-6">
<p>
Make sure you are in the right directory!
</p>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
<a href="https://docs.python.org/3/reference/expressions.html#comparisons">https://docs.python.org/3/reference/expressions.html#comparisons</a>
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Author: Alberto Valdez</p>
<p class="date">Created: 2022-07-18 Mon 19:24</p>
</div>
</body>
</html>
